src/Catalogs/Addresses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>Addresses</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Companies</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>FirstName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MiddleName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LastName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Cell</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Fax</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AddressLine1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AddressLine2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AddressLine3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>City</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>State</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.States</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Country</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Countries</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ZIP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultBilling</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultShipping</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RemitTo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Notes</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Salutation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Suffix</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF1String</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF2String</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF3String</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF4String</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF5String</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>JobTitle</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SalesPerson</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SalesPeople</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NewObject</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AddressValidated</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/AvalaraRequestTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>AvalaraRequestTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ConnectionTest</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AddressValidation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TaxCalculation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CancelTax</Name>
					<Comment>Voiding or Deleting documents at AvaTax</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/MessageStatus.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>MessageStatus</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>NoStatus</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Information</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Warning</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Addresses/Forms/AddressValidation/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	AddressRef	= Parameters.AddressRef;
	
	If Parameters.Property("OriginalAddress") Then
		OriginalAddress = Parameters.OriginalAddress;
		AddressLine1 	= OriginalAddress.AddressLine1;
		AddressLine2 	= OriginalAddress.AddressLine2;
		AddressLine3 	= OriginalAddress.AddressLine3;
		City			= OriginalAddress.City;
		Region			= OriginalAddress.State.Code;
		Country			= OriginalAddress.Country.Code;
		PostalCode		= OriginalAddress.ZIP;
		AvataxValidateAddressAtServer();
	EndIf;
	
EndProcedure

&AtServer
Procedure AvataxValidateAddressAtServer()
	
	// Set request parameters.
	RequestParameters = New Structure;
	RequestParameters.Insert("Line1", AddressLine1);
	RequestParameters.Insert("Line2", AddressLine2);
	RequestParameters.Insert("Line3", AddressLine3);
	RequestParameters.Insert("City", City);
	RequestParameters.Insert("Region", Region);
	RequestParameters.Insert("Country", Country);
	RequestParameters.Insert("PostalCode", PostalCode);
	
	DecodedBody = AvaTaxServer.SendRequestToAvalara(Enums.AvalaraRequestTypes.AddressValidation, RequestParameters, AddressRef);
	
	If DecodedBody.Successful Then
		
		AddressDetails = New Structure("Line1, Line2, Line3, City, Region, Country, AddressType, PostalCode, County, FIPSCode, PostNet, TaxRegionID");
		AvaTaxServer.ReadStructureValuesSafely(DecodedBody.Address, AddressDetails);
	
		ValidatedAddressLine1 	= AddressDetails.Line1;
		ValidatedAddressLine2 	= AddressDetails.Line2;
		ValidatedAddressLine3 	= AddressDetails.Line3;
		ValidatedCity			= AddressDetails.City;
		ValidatedRegion			= AddressDetails.Region;
		ValidatedCountry		= AddressDetails.Country;
		ValidatedCounty			= AddressDetails.County;
		ValidatedAddressType	= AddressDetails.AddressType;
		If ValidatedAddressType = "B" Then
			Items.AddressTypeDescription.Title = " - PO Box";
		ElsIf ValidatedAddressType = "C" Then
			Items.AddressTypeDescription.Title = " - City delivery";
		ElsIf ValidatedAddressType = "G" Then
			Items.AddressTypeDescription.Title = " - General delivery";
		ElsIf ValidatedAddressType = "H" Then
			Items.AddressTypeDescription.Title = " - Highway contract";
		ElsIf ValidatedAddressType = "R" Then
			Items.AddressTypeDescription.Title = " - Rural route";			
		EndIf;
		ValidatedPostalCode		= AddressDetails.PostalCode;
		ValidatedFIPSCode		= AddressDetails.FIPSCode;
		ValidatedPostNet		= AddressDetails.PostNet;
		ValidatedTaxRegionID	= AddressDetails.TaxRegionID; 
		
	Else
		
		ErrorOccured = True;
		ErrorMessage = DecodedBody.ErrorMessage;
		
	EndIf;

EndProcedure

&AtClient
Procedure Accept(Command)
	ValidatedAddress = New Structure();
	ValidatedAddress.Insert("AddressLine1", ValidatedAddressLine1);
	ValidatedAddress.Insert("AddressLine2", ValidatedAddressLine2);
	ValidatedAddress.Insert("AddressLine3", ValidatedAddressLine3);
	ValidatedAddress.Insert("City", ValidatedCity);
	ValidatedAddress.Insert("RegionCode", ValidatedRegion);
	ValidatedAddress.Insert("CountryCode", ValidatedCountry);
	ValidatedAddress.Insert("ZIP", ValidatedPostalCode);
	CloseParameters = New Structure("ValidatedAddress", ValidatedAddress);
	Close(CloseParameters);
EndProcedure


&AtClient
Procedure OnOpen(Cancel)
	If ErrorOccured Then
		CommonUseClient.ShowCustomMessageBox(ThisForm, "Address validation", ErrorMessage, PredefinedValue("Enum.MessageStatus.Warning"));
		ErrorOccured = False;
		ErrorMessage = "";
	EndIf;
EndProcedure


&AtClient
Procedure ValidateAddress(Command)
	AvataxValidateAddressAtServer();
	If ErrorOccured Then
		CommonUseClient.ShowCustomMessageBox(ThisForm, "Address validation", ErrorMessage, PredefinedValue("Enum.MessageStatus.Warning"));
		ErrorOccured = False;
		ErrorMessage = "";
	EndIf;
EndProcedure
